12-fvm-convection-in-OpenFOAM/case_1D_simple_convection/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
    leftBoundary
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }

    rightBoundary
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }

    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
